Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Creates a List control for the GUI.
fr: Crée un contrôle liste dans une GUI.

source: Creates a ListView control for the GUI.
fr: Crée un contrôle ListView dans une GUI.

source: Creates a ListView item.
fr: Crée un item de ListView.

source: Creates a Menu control for the GUI.
fr: Crée un contrôle Menu dans une GUI.

source: Creates a MenuItem control for the GUI.
fr: Crée un contrôle MenuItem dans une GUI.

source: Creates a month calendar control for the GUI.
fr: Crée un contrôle de Calendrier Mensuel dans une GUI.

source: Creates an ActiveX control in the GUI.
fr: Crée un contrôle ActiveX dans la GUI.

source: Creates a Picture control for the GUI.
fr: Crée un contrôle Picture (image) dans une GUI.

source: Creates a Progress control for the GUI.
fr: Crée un contrôle Progress dans une GUI.

source: Creates a Radio button control for the GUI.
fr: Crée un contrôle RadioButton dans une GUI.

source: Creates a Slider control for the GUI.
fr: Crée un contrôle Slider dans une GUI.

source: Creates a Tab control for the GUI.
fr: Crée un contrôle Tab (avec onglet) dans une GUI.

source: Creates a TabItem control within an existing tab control in the GUI.
fr: Crée un contrôle TabItem dans un contrôle Tab existant dans une GUI.

source: Creates a TreeView control for the GUI.
fr: Crée un contrôle TreeView (Vue arborescente) dans une GUI.

source: Creates a TreeViewItem control for the GUI.
fr: Crée un contrôle TreeViewItem dans le contrôle TreeView d'une GUI.

source: Creates an UpDown control for the GUI.
fr: Crée un contrôle UpDown dans une GUI.

source: Deletes a control.
fr: Supprime un contrôle.

source: The filename of the video.
fr: Le nom du fichier de la vidéo.

source: Only .avi files are supported.
fr: Seuls les fichiers .avi sont pris en charge.

source: id of the subfile to be used.
fr: ID du sous-fichier à utiliser.

source: If the file only contains one video then use 0.
fr: Si le fichier contient une seule vidéo alors utilisez -1.

source: The left side of the control.
fr: Le côté gauche du contrôle.

source: If -1 is used then left will be computed according to GUICoordMode.
fr: Si vaut -1, alors il sera calculée en fonction de GUICoordMode.

source: The top of the control.
fr: Le sommet du contrôle.

source: If -1 is used then top will be computed according to GUICoordMode.
fr: Si vaut -1 utilisée, alors il sera calculé en fonction de GUICoordMode.

source: The width of the control (default is the previously used width).
fr: La largeur de la du contrôle (par défaut est la largeur utilisé précédemment).

source: The height of the control (default is the previously used height).
fr: La hauteur de la du contrôle (par défaut est la hauteur utilisé précédemment).

source: Defines the style of the control.
fr: Définit le style du contrôle.

source: default (-1) :
fr: défaut (-1) :

source: $ACS_TRANSPARENT is always used unless $ACS_NONTRANSPARENT is specified.
fr: $ACS_TRANSPARENT est toujours utlisé à moins que $ACS_NONTRANSPARENT soit spécifié.

source: Defines the extended style of the control.
fr: Définit le style étendu du contrôle.

source: See Extended Style Table.
fr: Consultez Tableau des Styles étendus.

source: the identifier (controlID) of the new control.
fr: Retourne l'identifiant (ID du contrôle) du nouveau contrôle.

source: To obtain the value of the control see GUICtrlRead().
fr: Pour obtenir la valeur du contrôle, Consultez GUICtrlRead.

source: To set or change information in the control see GUICtrlUpdate...() functions.
fr: Pour définir ou modifier des informations dans le contrôle, Consultez GUICtrlUpdate....

source: To start the video as soon as the control is created use the $ACS_AUTOPLAY style.
fr: Pour lancer la vidéo dès que le contrôle est créé utilisez le style $ACS_AUTOPLAY.

source: You can can start and stop the animation by setting the state to 1 or 0 with GUICtrlSetState().
fr: Vous pouvez peut démarrer et arrêter l'animation en définissant l'état à 1 ou 0 avec GUICtrlSetState.

source: See example.
fr: Consultez l'exemple.

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_AVI, newstyle, ...).
fr: Pour combiner les styles avec l'utilisation de style par défaut BitOR($GUI_SS_DEFAULT_AVI, newstyle, ...).

source: To use the values specified above you must #include <AVIConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez préciser #include <AVIConstants.au3> dans votre script.

source: Default resizing is $GUI_DOCKSIZE.
fr: Le redimensionnement par défaut est $GUI_DOCKSIZE.

source: Create an animation control.
fr: Crée un contrôle d'animation.

source: Start the animation.
fr: Lance l'animation.

source: Stop the animation.
fr: Arrête l'animation.

source: The text of the button control.
fr: Le texte du bouton.

source: The width of the control (default text autofit in width).
fr: La largeur du bouton (Le texte par défaut se met à l'échelle).

source: The height of the control (default text autofit in height).
fr: La hauteur du bouton (Le texte par défaut se met à l'échelle).

source: default ( -1) : none.
fr: Par défaut ( -1) : aucun style.

source: forced styles :
fr: Styles forcés :

source: A Button control can display an icon or image by using the $BS_ICON or $BS_BITMAP style.
fr: Un bouton peut afficher une icône ou un bouton en utilisant les styles $BS_ICON ou $BS_BITMAP.

source: Use GUICtrlSetImage() to specify the picture to use.
fr: Utiliser GUICtrlSetImage pour spécifier l'image à utiliser.

source: To combine styles with the default style use BitOR ( $GUI_SS_DEFAULT_BUTTON, newstyle, ...).
fr: Pour combiner des styles avec ceux par défaut, utiliser BitOR($GUI_SS_DEFAULT_BUTTON, nouveaustyle,...).

source: To use the values specified above you must #include <ButtonConstants.au3> in your script.
fr: Pour utiliser les valeurs présentées, vous devez inclure #include <ButtonConstants.au3> dans votre script.

source: Default resizing is $GUI_DOCKSIZE
fr: Le redimensionnement par défaut est $GUI_DOCKSIZE.

source: Create a button control.
fr: Crée un contrôle bouton.

source: Run Notepad with the window maximized.
fr: Exécute le Bloc-notes avec la fenêtre agrandie au maximum.

source: Close the Notepad process using the PID returned by Run.
fr: Ferme le processus Notepad en utilisant le PID renvoyée par Run.

source: The text of the control checkbox.
fr: Le texte du contrôle de la case à cocher

source: default ( -1) :
fr: Par défaut ( -1) :

source: $WS_TABSTOP, and $BS_AUTOCHECKBOX if no checkbox style defined.
fr: $WS_TABSTOP, et $BS_AUTOCHECKBOX si aucun styles chekkbox n'est défini.

source: A Checkbox control can display an icon or image by using the $BS_ICON or $BS_BITMAP style.
fr: Un contrôle de case à cocher permet d'afficher une icône ou une image en utilisant le style $BS_ICON ou $BS_BITMAP.

source: To combine styles with the default style use BitOR/a> ( $GUI_SS_DEFAULT_CHECKBOX, newstyle, ...).
fr: Pour combiner les styles avec les styles par défaut, utilisez BitOR/a>($GUI_SS_DEFAULT_CHECKBOX, newstyle,...).

source: Default resizing is $GUI_DOCKHEIGHT.
fr: Redimensionnement par défaut est $GUI_DOCKHEIGHT.

source: Create a checkbox control.
fr: Crée un contrôle Checkbox (cases à cocher).

source: The text which will appear in the combo control.
fr: Le texte qui apparaîtra dans le contrôle ComboBox.

source: forced style :
fr: Style forçé :

source: [optional]Defines the extended style of the control.
fr: [optional] Définit le style étendu du contrôle.

source: Under Windows XP/2003 Windows will adjust the size of the opened combo.
fr: Sous Windows XP/2003 Windows ajustera la taille du combo ouvert.

source: On other Windows versions you can define this size with the "height" parameter if the default value is not BIG enough to contain at least one line.
fr: Sous les autres versions de Windows, vous pouvez déterminer cette taille avec le paramètre "height" si la valeur par défaut n'est pas ASSEZ GRANDE pour contenir au moins une ligne.

source: To combine styles with the default style use BitOR/a> ( $GUI_SS_DEFAULT_COMBO, newstyle, ...).
fr: Pour combiner les styles avec le style par défaut, utilisez BitOR/a>($GUI_SS_DEFAULT_COMBO, newstyle,...).

source: To use the values specified above you must #include <ComboConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez ajouter #include <ComboConstants.au3> dans votre script.

source: Create a combobox control.
fr: Crée un contrôle ComboBox.

source: Add additional items to the combobox.
fr: Ajoute des items supplémentaires à la ComboBox.

source: Control identifier as returned by a GUICtrlCreate...() function.
fr: Identificateur de contrôle tel que retourné par GUICtrlCreate...

source: After creating the context menu main control with this function, each menu item can be created by using GUICtrlCreateMenuItem().
fr: Après la création de la commande de menu contextuel principal de cette fonction, chaque élément de menu peut être créé en utilisant GUICtrlCreateMenuItem.

source: Sub-menus can be created using GUICtrlCreateMenu().
fr: Les sous-menus peuvent être créés avec GUICtrlCreateMenu.

source: If you use no parameters or -1 in this function then the context menu that is created is associated with the entire GUI window rather than an individual control.
fr: Si vous n'utilisez aucun des paramètres ou -1 dans cette fonctionalors le menu contextuel qui est créé est associé à la fenêtre entière GUI plutôt qu'à un contrôle individuel.

source: Only one context menu per control is possible.
fr: Un seul menu contextuel par un contrôle est possible.

source: If you wish to create a new context menu one you have to delete the existing menu first.
fr: Si vous souhaitez en créer un nouveau, vous devez d'abord supprimer le menu actuel.

source: You can't create context menus for controls that already have system context menus, i.e. edit or input controls.
fr: Vous ne pouvez pas créer des menus contextuels pour les contrôles qui ont déjà un système de menus contextuels, à savoir des Edits ou des Inputs.

source: right click on gui to bring up context Menu.
fr: un clic droit sur la gui fait apparaître le menu contextuel.

source: right click on the "ok" button to bring up a controll specific context menu.
fr: un clic droit sur le bouton "ok" fait apparaître un menu contextuel spécifique à un contrôle.

source: separator
fr: séparateur

source: At first create a dummy control for the options and a contextmenu for it
fr: Dans un premier temps crée un contrôle factice pour les options et un menu contextuel pour lui

source: Create a dummy control and a contextmenu for the help too
fr: Crée un contrôle factice et un menu contextuel pour l'aide

source: Show a menu in a given GUI window which belongs to a given GUI ctrl
fr: Affiche un menu dans une fenêtre GUI donnée qui appartient à un ctrl GUI donné

source: Convert the client (GUI) coordinates to screen (desktop) coordinates
fr: Convertit les coordonnées client GUI en coordonnées écran (bureau)

source: release Struct not really needed as it is a local
fr: Libére la Struct: pas vraiment nécessaire car elle est locale

source: Show at the given coordinates (x, y) the popup menu (hMenu) which belongs to a given GUI window (hWnd)
fr: Montre les coordonnées données (x, y) dans le menu contextuel (hMenu) qui appartient à une fenêtre de la GUI donnée (hWnd)

source: The preselected date (always as "yyyy/mm/dd").
fr: La date présélectionnée (toujours au format "aaaa/mm/dd").

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_DATE, newstyle, ...).
fr: Pour combiner les styles avec le style par défaut, utilisez BitOR($GUI_SS_DEFAULT_DATE, newstyle, ...).

source: To use the values specified above you must #include <DateTimeConstants.au3> in your script.
fr: Pour utiliser les valeurs indiquées ci-dessus, vous devez ajouter #include <DateTimeConstants.au3> dans votre script.

source: To Format the date/time see example 3 to understand how to use a GUICtrlSendMsg() with a $DTM_SETFORMAT.
fr: Pour formater la date/heure, consultez l'exemple 3 pour comprendre comment utiliser un GUICtrlSendMsg() avec $DTM_SETFORMAT.

source: to select a specific default format
fr: Sélectionne un format par défaut spécifique

source: The text of the control.
fr: Le texte du contrôle.

source: [optional]Defines the style of the control.
fr: [optional] Définit le style du contrôle.

source: $ES_MULTILINE, $WS_TABSTOP only if not $ES_READONLY
fr: $ES_MULTILINE, $WS_TABSTOP seulement sans $ES_READONLY

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_EDIT, newstyle, ...).
fr: Pour combiner des styles avec le style par défaut, utilisez BitOR($GUI_SS_DEFAULT_EDIT, newstyle,...).

source: To use the values specified above you must #include <EditConstants.au3> in your script.
fr: Pour utiliser les valeurs indiquées ci-dessus, vous devez inclure <EditConstants.au3> dans votre script.

source: If you want to drag & drop a filename onto this control just add the WS_EX_ACCEPTFILES extended style on the GUICreate() and set the state to $GUI_DROPACCEPTED.
fr: Si vous souhaitez glisser et déposer (drag & drop) un nom de fichier sur ce contrôle suffit d'ajouter le style étendu WS_EX_ACCEPTFILES dans GUICreate() et définir l'état à $GUI_DROPACCEPTED.

source: Multiple selected files will be dropped as separate lines.
fr: Si plusieurs fichiers sont sélectionnés , ils seront déposés sur des lignes distinctes.

source: Default resizing is $GUI_DOCKAUTO size and position will occur.
fr: Le redimensionnement par défaut est $GUI_DOCKAUTO, la taille et la position seront modifiés.

source: Creating a RichEdit control is too complex so it will not be included as a basic control.
fr: La création d'un contrôle RichEdit est trop complexe donc ne sera pas inclus dans un contrôle de base.

source: You have to use the _GUICtrlRichEdit_Create().
fr: Vous devez utiliser _GUICtrlRichEdit_Create().

source: will create a dialog box that when displayed is centered
fr: Permet de créer une boîte de dialogue qui sera affichée au centre de l'écran

source: will be append dont' forget 3rd parameter
fr: données ajoutées: n'oubliez pas le 3ème paramètre

source: To draw in the control see GUICtrlSetGraphic().
fr: Pour dessiner dans le contrôle, Consultez GUICtrlSetGraphic.

source: The border and background color can be set with GUICtrlSetBkColor() and GUICtrlSetColor().
fr: La couleur du contour et la couleur de fond peuvent être définies avec GUICtrlSetBkColor() et GUICtrlSetColor().

source: Graphic control can be clicked so they should not overlap with other controls.
fr: Le contrôle graphique peut être cliqué donc il ne devrait pas recouvrir d'autres contrôles.

source: If overlap is needed it is important to disable the graphic control :
fr: Si le recouvrement est nécessaire, il est important de désactiver le contrôle graphique:

source: This control cannot be resized due to fix graphic relative addressing creation but can be dock with GUICtrlSetResizing().
fr: Ce contrôle ne peut pas être redimensionné en raison d'une correction relative à l'adressage lors de sa création, mais il peut être attaché avec GUICtrlSetResizing().

source: 0 and $g_MAXGr entries not used to allow GUICtrlDelete result
fr: 0 et les entrées $g_MAXGr ne sont pas utilisés pour permettre le résultat de GUICtrlDelete

source: start point
fr: le point de départ

source: it is better to draw line and after point
fr: il est préférable de tracer une ligne et après le point

source: to avoid to switch color at each drawing
fr: pour éviter de basculer la couleur à chaque dessin

source: A group control is the thin line you see around controls (usually only Radio button) that visually groups them together.
fr: Un groupe de contrôle est la mince ligne que vous voyez autour des contrôles (généralement le bouton radio uniquement) qui les regroupe de manière visuelle.

source: Only one Radio button within a Group can be selected at once.
fr: Un seul bouton radio dans un groupe peut être sélectionné à la fois.

source: If you want to have multiple groups without the visible line then you must use GUIStartGroup() to group your Radio buttons.
fr: Si vous voulez avoir plusieurs groupes sans la ligne visible, alors vous devez utiliser GUIStartGroup() pour regrouper vos boutons radio.

source: close group
fr: Ferme le groupe

source: will display an empty dialog box
fr: Affiche une boîte de dialogue vide

source: filename of the icon to be loaded.
fr: Nom du fichier contenant l'icône à charger.

source: Icon name if the file contains multiple icons.
fr: Nom de l'icône si le fichier contient plusieurs icônes.

source: Can be an ordinal name if negative number.
fr: Peut être un nom ordinal en cas de nombre négatif.

source: Otherwise -1.
fr: Sinon -1.

source: The width of the control (default is 32).
fr: La largeur du contrôle (32 par défaut).

source: The height of the control (default is 32).
fr: La hauteur du contrôle (32 par défaut).

source: To update the icon after the dialog box is displayed use GUICtrlSetImage()
fr: Pour mettre à jour l'icône après l'affichage de la boite de dialogue utilisez GUICtrlSetImage

source: iconName can reference the icon group number.
fr: iconName peut indiquer le numéro du groupe d'icônes.

source: Use a resource hacker to find the correct value.
fr: Utilisez un hacker de ressources pour connaître la valeur.

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_ICON, newstyle, ...).
fr: Pour combiner des styles avec le style par défaut utilisez BitOR($GUI_SS_DEFAULT_ICON, newstyle,...).

source: To use the values specified above you must #include <StaticConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus vous devez inclure #include <StaticConstants.au3> dans votre script.

source: Passing a positive number will reference the string equivalent icon name.
fr: Passer un nombre positif référencera la chaîne équivalente au nom de l'icône.

source: Passing a negative number causes 1-based "index" behaviour.
fr: Passer un nombre négatif impliquera un "index" base 1.

source: Some Dll can have icon extracted just with negative numbers.
fr: Certaines DLL peuvent avoir une icône extraite seulement avec un nombre négatif.

source: $WS_TABSTOP only if no $ES_READONLY.
fr: $WS_TABSTOP seulement si non $ES_READONLY.

source: $ES_MULTILINE is always reset.
fr: $ES_MULTILINE est toujours réinitialisé.

source: For defining an input control for entering passwords (input is hidden with an asterisk) use the $ES_PASSWORD style.
fr: Pour définir un contrôle Input afin d'entrer un mot de passe (l'entrée de donnée est cachée par des astérisques) utilisez le style $ES_PASSWORD.

source: After multiple drag and drop files on this control, you can retrieve the files name which are separated by "|" with GUICtrlRead().
fr: Après de multiple glissés déplacés de fichiers dans ce contrôle.Vous pouvez récupérer les noms des fichiers qui sont séparés par « | » avec GUICtrlRead().

source: will not accept drag&drop files
fr: n'acceptera pas le drag & drop des fichiers

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_LABEL, newstyle, ...
fr: Pour combiner les styles avec le style par défaut, utilisez BitOR($GUI_SS_DEFAULT_LABEL, newstyle, ...

source: The extended style $GUI_WS_EX_PARENTDRAG can be used to allow the dragging of the parent window for windows that don't have a titlebar (no $WS_CAPTION style in GUICreate()).
fr: Le style étendu $GUI_WS_EX_PARENTDRAG peut être utilisé pour permettre le glissement de la fenêtre parente, pour les fenêtres qui n'ont pas de barre de titre (pas de style $WS_CAPTION avec GUICreate()).

source: To set the background to transparent, use GUICtrlSetBkColor(-1, $GUI_BKCOLOR_TRANSPARENT).
fr: Pour définir la transparence, utiliser GUICtrlSetBkColor(-1, $GUI_BKCOLOR_TRANSPARENT)..

source: will run notepad if F1 is typed
fr: exécute le Bloc-notes si F1 est tapé

source: first cell 70 width
fr: la première cellule de 70 de large

source: next line
fr: ligne suivante

source: next line and next cell
fr: ligne suivante et cellule suivante

source: next cell same line
fr: cellule suivante même ligne

source: next line Cell1
fr: ligne suivante Cell1

source: The different list entries that can be selected can be set with GUICtrlSetData()
fr: Les différentes entrées de liste qui peuvent être sélectionnées peuvent être réglées avec GUICtrlSetData

source: To limit horizontal scrolling use GUICtrlSetLimit()
fr: Pour limiter l'utilisation de défilement horizontal GUICtrlSetLimit

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_LIST, newstyle, ...).
fr: Pour combiner les styles avec l'utilisation de style par défaut BitOR($GUI_SS_DEFAULT_LIST, newstyle,...).

source: To use the values specified above you must #include <ListBoxConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées ci-dessus, vous devez inclure #include <ListBoxConstants.au3> dans votre script.

source: to limit horizontal scrolling
fr: Limite le défilement horizontal

source: definition of columns heading.
fr: Définition des entêtes des colonnes.

source: Each of them are separated with Opt("GUIDataSeparatorChar").
fr: Elles sont séparées avec Opt("GUIDataSeparatorChar").

source: See Extended Style Table or ListView Extended Style Table.
fr: Consultez Extended Style Table ou ListView Extended Style Table.

source: To add items to a ListView control use GUICtrlCreateListViewItem()
fr: Pour ajouter des items à un contrôle ListView utilisez GUICtrlCreateListViewItem()

source: The ListView will appear by default as in the Explorer view "Details" (LVS_REPORT style is forced).
fr: Le ListView apparaîtra par défaut comme dans la vue des détails de l' Explorer (le style LVS_REPORT est forcé).

source: You can control initial column size by padding blanks to the column heading definition.
fr: Vous pouvez contrôler la taille initiale des colonnes par des blancs de remplissage dans la définition des entêtes de colonnes.

source: The column can be extend during the GUICtrlCreateListViewItem() according to item size.
fr: La colonne peut être étendue avec GUICtrlCreateListViewItem() selon la taille de l'item.

source: Size of a column will be up to around 25 characters.
fr: La taille d'une colonne ira jusqu'à environ 25 caractères.

source: No resizing will be done during an update by GUICtrlSetData().
fr: Aucun redimensionnement se fera lors d'une mise à jour par GUICtrlSetData().

source: To create a ListView with Icon-, SmallIcon- or List-style just use after creation:
fr: Pour créer un ListView avec icône, petit icône ou style de liste, utilisez après création:

source: GUICtrlSetStyle() with the styles $LVS_ICON, $LVS_LIST or $LVS_SMALLICON.
fr: GUICtrlSetStyle() avec les styles $LVS_ICON, $LVS_LIST or $LVS_SMALLICON.

source: Sorting the list by clicking the column name (as in Explorer) is not currently implemented.
fr: Le tri d'une liste en cliquant sur le nom de la colonne (comme dans l' Explorer) n'est pas mis en oeuvre actuellement.

source: To have the entire line visually selected use the extended style LVS_EX_FULLROWSELECT.
fr: Pour avoir la ligne entière visuellement sélectionnée utilisez le extended style LVS_EX_FULLROWSELECT.

source: To combine styles with the default style use BitOR($GUI_SS_DEFAULT_LISTVIEW, newstyle, ...).
fr: Pour combiner des styles avec le style par défaut utilisez BitOR($GUI_SS_DEFAULT_LISTVIEW, newstyle,...).

source: To use the values specified above you must #include <ListViewConstants.au3> in your script.
fr: Pour utiliser les valeurs spécifiées précédemment utilisez #include <ListViewConstants.au3> dans votre script.
